ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_adc_regs.xml
<module id="ADC_REGS" HW_revision="" description="ADC Registers">
	<register id="ADCCTL1" width="16" page="1" offset="0x0" internal="0" description="ADC Control 1 Register">
		<bitfield id="INTPULSEPOS" description="ADC Interrupt Pulse Position" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCPWDNZ" description="ADC Power Down" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCBSYCHN" description="ADC Busy Channel" begin="11" end="8" width="4" rwaccess="R"/>
		<bitfield id="ADCBSY" description="ADC Busy" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXTMUXPRESELECTEN" description="External Mux Preselect Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TDMAEN" description="Enable Alternate DMA Timings" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCTL2" width="16" page="1" offset="0x1" internal="0" description="ADC Control 2 Register">
		<bitfield id="PRESCALE" description="ADC Clock Prescaler" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCBURSTCTL" width="16" page="1" offset="0x6" internal="0" description="ADC Burst Control Register">
		<bitfield id="BURSTTRIGSEL" description="SOC Burst Trigger Source Select" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="BURSTSIZE" description="SOC Burst Size Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="BURSTEN" description="SOC Burst Mode Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTFLG" width="16" page="1" offset="0x7" internal="0" description="ADC Interrupt Flag Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ADCINT1RESULT" description="ADC Interrupt 1 Results Ready" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ADCINT2RESULT" description="ADC Interrupt 2 Results Ready" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ADCINT3RESULT" description="ADC Interrupt 3 Results Ready" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ADCINT4RESULT" description="ADC Interrupt 4 Results Ready" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="ADCINTFLGCLR" width="16" page="1" offset="0x8" internal="0" description="ADC Interrupt Flag Clear Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTOVF" width="16" page="1" offset="0x9" internal="0" description="ADC Interrupt Overflow Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Overflow Flags" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Overflow Flags" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Overflow Flags" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Overflow Flags" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="ADCINTOVFCLR" width="16" page="1" offset="0xa" internal="0" description="ADC Interrupt Overflow Clear Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Overflow Clear Bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Overflow Clear Bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Overflow Clear Bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Overflow Clear Bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTSEL1N2" width="16" page="1" offset="0xb" internal="0" description="ADC Interrupt 1 and 2 Selection Register">
		<bitfield id="INT1SEL" description="ADCINT1 EOC Source Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="INT1CONT" description="ADCINT1 Continue to Interrupt Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT1E" description="ADCINT1 Interrupt Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INT2SEL" description="ADCINT2 EOC Source Select" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="INT2CONT" description="ADCINT2 Continue to Interrupt Mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INT2E" description="ADCINT2 Interrupt Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTSEL3N4" width="16" page="1" offset="0xc" internal="0" description="ADC Interrupt 3 and 4 Selection Register">
		<bitfield id="INT3SEL" description="ADCINT3 EOC Source Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="INT3CONT" description="ADCINT3 Continue to Interrupt Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT3E" description="ADCINT3 Interrupt Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INT4SEL" description="ADCINT4 EOC Source Select" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="INT4CONT" description="ADCINT4 Continue to Interrupt Mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INT4E" description="ADCINT4 Interrupt Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCPRICTL" width="16" page="1" offset="0xd" internal="0" description="ADC SOC Priority Control Register">
		<bitfield id="SOCPRIORITY" description="SOC Priority" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="RRPOINTER" description="Round Robin Pointer" begin="10" end="6" width="5" rwaccess="R"/>
	</register>
