ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_adc_regs.xml
	<register id="ADCINTSOCSEL1" width="32" page="1" offset="0xe" internal="0" description="ADC Interrupt SOC Selection 1 Register">
		<bitfield id="SOC0" description="SOC0 ADC Interrupt Trigger Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 ADC Interrupt Trigger Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 ADC Interrupt Trigger Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 ADC Interrupt Trigger Select" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 ADC Interrupt Trigger Select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 ADC Interrupt Trigger Select" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 ADC Interrupt Trigger Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 ADC Interrupt Trigger Select" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 ADC Interrupt Trigger Select" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 ADC Interrupt Trigger Select" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 ADC Interrupt Trigger Select" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 ADC Interrupt Trigger Select" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 ADC Interrupt Trigger Select" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 ADC Interrupt Trigger Select" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 ADC Interrupt Trigger Select" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 ADC Interrupt Trigger Select" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCSOCFLG1" width="16" page="1" offset="0x12" internal="0" description="ADC SOC Flag 1 Register">
		<bitfield id="SOC0" description="SOC0 Start of Conversion Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOC1" description="SOC1 Start of Conversion Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SOC2" description="SOC2 Start of Conversion Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOC3" description="SOC3 Start of Conversion Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SOC4" description="SOC4 Start of Conversion Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SOC5" description="SOC5 Start of Conversion Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SOC6" description="SOC6 Start of Conversion Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SOC7" description="SOC7 Start of Conversion Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SOC8" description="SOC8 Start of Conversion Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SOC9" description="SOC9 Start of Conversion Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SOC10" description="SOC10 Start of Conversion Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SOC11" description="SOC11 Start of Conversion Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SOC12" description="SOC12 Start of Conversion Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SOC13" description="SOC13 Start of Conversion Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SOC14" description="SOC14 Start of Conversion Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SOC15" description="SOC15 Start of Conversion Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="ADCSOCFRC1" width="16" page="1" offset="0x14" internal="0" description="ADC SOC Force 1 Register">
		<bitfield id="SOC0" description="SOC0 Force Start of Conversion Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 Force Start of Conversion Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 Force Start of Conversion Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 Force Start of Conversion Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 Force Start of Conversion Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 Force Start of Conversion Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 Force Start of Conversion Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 Force Start of Conversion Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 Force Start of Conversion Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 Force Start of Conversion Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 Force Start of Conversion Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 Force Start of Conversion Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 Force Start of Conversion Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 Force Start of Conversion Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 Force Start of Conversion Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 Force Start of Conversion Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCOVF1" width="16" page="1" offset="0x16" internal="0" description="ADC SOC Overflow 1 Register">
		<bitfield id="SOC0" description="SOC0 Start of Conversion Overflow Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOC1" description="SOC1 Start of Conversion Overflow Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SOC2" description="SOC2 Start of Conversion Overflow Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOC3" description="SOC3 Start of Conversion Overflow Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SOC4" description="SOC4 Start of Conversion Overflow Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SOC5" description="SOC5 Start of Conversion Overflow Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SOC6" description="SOC6 Start of Conversion Overflow Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SOC7" description="SOC7 Start of Conversion Overflow Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SOC8" description="SOC8 Start of Conversion Overflow Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SOC9" description="SOC9 Start of Conversion Overflow Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SOC10" description="SOC10 Start of Conversion Overflow Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SOC11" description="SOC11 Start of Conversion Overflow Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SOC12" description="SOC12 Start of Conversion Overflow Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SOC13" description="SOC13 Start of Conversion Overflow Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SOC14" description="SOC14 Start of Conversion Overflow Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SOC15" description="SOC15 Start of Conversion Overflow Flag" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
