ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_adc_regs.xml
	<register id="ADCEVTCLR" width="16" page="1" offset="0x5c" internal="0" description="ADC Event Clear Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Clear" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCEVTSEL" width="16" page="1" offset="0x5e" internal="0" description="ADC Event Selection Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Event Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Event Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Event Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Event Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Event Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Event Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Event Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Event Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Event Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Event Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Event Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Event Enable" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCEVTINTSEL" width="16" page="1" offset="0x60" internal="0" description="ADC Event Interrupt Selection Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Interrupt Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Interrupt Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Interrupt Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Interrupt Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Interrupt Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Interrupt Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Interrupt Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Interrupt Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Interrupt Enable" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCOUNTER" width="16" page="1" offset="0x63" internal="0" description="ADC Counter Register">
		<bitfield id="FREECOUNT" description="ADC Free Running Counter Value" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCREV" width="16" page="1" offset="0x64" internal="0" description="ADC Revision Register">
		<bitfield id="TYPE" description="ADC Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="REV" description="ADC Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="ADCOFFTRIM" width="16" page="1" offset="0x65" internal="0" description="ADC Offset Trim Register">
		<bitfield id="OFFTRIM" description="ADC Offset Trim" begin="11" end="0" width="12" rwaccess="RW"/>
	</register>
	<register id="ADCCONFIG2" width="32" page="1" offset="0x66" internal="0" description="ADC Config Register Upper 32 bits">
		<bitfield id="TESTANA1_CONFIG" description="TESTANA1 ADC Configuration" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1CONFIG" width="16" page="1" offset="0x6a" internal="0" description="ADC PPB{#} Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 1 Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 1 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 1 Two's Complement Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DELTAEN" description="ADC Post Processing Block 1 Last Sample Delta Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
