ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_adc_regs.xml
	<register id="ADCPPB4CONFIG" width="16" page="1" offset="0x9a" internal="0" description="ADC PPB{#} Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 4 Configuration" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 4 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 4 Two's Complement Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DELTAEN" description="ADC Post Processing Block 4 Last Sample Delta Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4STAMP" width="16" page="1" offset="0x9b" internal="0" description="ADC PPB4 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 4 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB4OFFCAL" width="16" page="1" offset="0x9c" internal="0" description="ADC PPB4 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4OFFREF" width="16" page="1" offset="0x9d" internal="0" description="ADC PPB4 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 4 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4TRIPHI" width="32" page="1" offset="0x9e" internal="0" description="ADC PPB4 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 4 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4TRIPLO" width="32" page="1" offset="0xa0" internal="0" description="ADC PPB4 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 4 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPBTRIP4FILCTL" width="16" page="1" offset="0xa2" internal="0" description="ADCEVT4 Trip High Filter Control Register">
		<bitfield id="FILTHIEN" description="ADCPPB4 TRIPHI Filter Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTLOEN" description="ADCPPB4 TRIPLO Filter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPBTRIP4FILCLKCTL" width="32" page="1" offset="0xa4" internal="0" description="ADCEVT4 Trip High Filter Prescale Control Register">
		<bitfield id="CLKPRESCALE" description="Filter Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCINTCYCLE" width="16" page="1" offset="0xb9" internal="0" description="ADC Early Interrupt Generation Cycle">
		<bitfield id="DELAY" description="Delay from ADCSOC fall edge to early interrupt generation." begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM1" width="32" page="1" offset="0xba" internal="0" description="ADC Linearity Trim 1 Register">
		<bitfield id="INLTRIM31TO0" description="ADC Linearity Trim Bits 31-0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM2" width="32" page="1" offset="0xbc" internal="0" description="ADC Linearity Trim 2 Register">
		<bitfield id="INLTRIM63TO32" description="ADC Linearity Trim Bits 63-32" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM3" width="32" page="1" offset="0xbe" internal="0" description="ADC Linearity Trim 3 Register">
		<bitfield id="INLTRIM95TO64" description="ADC Linearity Trim Bits 95-64" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM4" width="32" page="1" offset="0xc0" internal="0" description="ADC Linearity Trim 4 Register">
		<bitfield id="INLTRIM127TO96" description="ADC Linearity Trim Bits 127-96" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM5" width="32" page="1" offset="0xc2" internal="0" description="ADC Linearity Trim 5 Register">
		<bitfield id="INLTRIM159TO128" description="ADC Linearity Trim Bits 159-128" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM6" width="32" page="1" offset="0xc4" internal="0" description="ADC Linearity Trim 6 Register">
		<bitfield id="INLTRIM191TO160" description="ADC Linearity Trim Bits 191-160" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCREV2" width="16" page="1" offset="0xc7" internal="0" description="ADC Wrapper Revision Register">
		<bitfield id="WRAPPERTYPE" description="ADC Wrapper Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="WRAPPERREV" description="ADC Wrapper Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="REP1CTL" width="32" page="1" offset="0xca" internal="0" description="ADC Trigger Repeater 1 Control Register">
		<bitfield id="MODE" description="ADC Trigger Repeater 1 Mode Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACTIVEMODE" description="ADC Trigger Repeater 1 Active Mode" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULEBUSY" description="ADC Trigger Repeater 1 Module Busy" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PHASEOVF" description="ADC Trigger Repeater 1 Phase Delay Overflow" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 1 Oversampled Trigger Overflow" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGER" description="ADC Trigger Repeater 1 Trigger Select" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="ADC Trigger Repeater 1 Sync. In Select" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="ADC Trigger Repeater 1 Software Sync." begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REP1N" width="32" page="1" offset="0xcc" internal="0" description="ADC Trigger Repeater 1 N Select Register">
		<bitfield id="NSEL" description="ADC Trigger Repeater 1 Trigger Number Selection" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NCOUNT" description="ADC Trigger Repeater 1 Trigger Counter" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="REP1PHASE" width="32" page="1" offset="0xce" internal="0" description="ADC Trigger Repeater 1 Phase Select Register">
		<bitfield id="PHASE" description="ADC Trigger Repeater 1 Phase Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="PHASECOUNT" description="ADC Trigger Repeater 1 Phase Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP1SPREAD" width="32" page="1" offset="0xd0" internal="0" description="ADC Trigger Repeater 1 Spread Select Register">
		<bitfield id="SPREAD" description="ADC Trigger Repeater 1 Spread Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SPREADCOUNT" description="ADC Trigger Repeater 1 Spread Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP1FRC" width="16" page="1" offset="0xd2" internal="0" description="ADC Trigger Repeater 1 Software Force Register">
		<bitfield id="SWFRC" description="ADC Trigger Repeater 1 Software Force" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="REP2CTL" width="32" page="1" offset="0xda" internal="0" description="ADC Trigger Repeater 2 Control Register">
		<bitfield id="MODE" description="ADC Trigger Repeater 2 Mode Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACTIVEMODE" description="ADC Trigger Repeater 2 Active Mode" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULEBUSY" description="ADC Trigger Repeater 2 Module Busy" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PHASEOVF" description="ADC Trigger Repeater 2 Phase Delay Overflow" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 2 Oversampled Trigger Overflow" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGER" description="ADC Trigger Repeater 2 Trigger Select" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="ADC Trigger Repeater 2 Sync. In Select" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="ADC Trigger Repeater 2 Software Sync." begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REP2N" width="32" page="1" offset="0xdc" internal="0" description="ADC Trigger Repeater 2 N Select Register">
		<bitfield id="NSEL" description="ADC Trigger Repeater 2 Trigger Number Selection" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NCOUNT" description="ADC Trigger Repeater 2 Trigger Counter" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="REP2PHASE" width="32" page="1" offset="0xde" internal="0" description="ADC Trigger Repeater 2 Phase Select Register">
		<bitfield id="PHASE" description="ADC Trigger Repeater 2 Phase Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="PHASECOUNT" description="ADC Trigger Repeater 2 Phase Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP2SPREAD" width="32" page="1" offset="0xe0" internal="0" description="ADC Trigger Repeater 2 Spread Select Register">
		<bitfield id="SPREAD" description="ADC Trigger Repeater 2 Spread Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SPREADCOUNT" description="ADC Trigger Repeater 2 Spread Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP2FRC" width="16" page="1" offset="0xe2" internal="0" description="ADC Trigger Repeater 2 Software Force Register">
		<bitfield id="SWFRC" description="ADC Trigger Repeater 2 Software Force" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1LIMIT" width="16" page="1" offset="0xea" internal="0" description="ADC PPB1Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 1 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
