ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_adc_regs.xml
	<register id="ADCPPB3CONFIG2" width="16" page="1" offset="0x122" internal="0" description="ADC PPB3 Sum Shift Register">
		<bitfield id="SHIFT" description="Post Processing Block 3 Right Shift" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="Post Processing Block 3 Sync. Input Select" begin="9" end="4" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="Post Processing Block 3 Software Force Sync. " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSINTSEL" description="Post Processing Block 3 Interrupt Source Select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMPSEL" description="Post Processing Block 3 Compare Source Select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3PSUM" width="32" page="1" offset="0x124" internal="0" description="ADC PPB3 Partial Sum Register">
		<bitfield id="PSUM" description="Post Processing Block 3 Oversampling Partial Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMAX" width="32" page="1" offset="0x126" internal="0" description="ADC PPB3 Partial Max Register">
		<bitfield id="PMAX" description="Post Processing Block 3 Oversampling Partial Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMAXI" width="16" page="1" offset="0x128" internal="0" description="ADC PPB3 Partial Max Index Register">
		<bitfield id="PMAXI" description="Post Processing Block 3 Oversampling Partial Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMIN" width="32" page="1" offset="0x12a" internal="0" description="ADC PPB3 Partial MIN Register">
		<bitfield id="PMIN" description="Post Processing Block 3 Oversampling Partial Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMINI" width="16" page="1" offset="0x12c" internal="0" description="ADC PPB3 Partial Min Index Register">
		<bitfield id="PMINI" description="Post Processing Block 3 Oversampling Partial Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3TRIPLO2" width="32" page="1" offset="0x12e" internal="0" description="ADC PPB3 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 3 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4LIMIT" width="16" page="1" offset="0x138" internal="0" description="ADC PPB4Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 4 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPBP4PCOUNT" width="16" page="1" offset="0x13a" internal="0" description="ADC PPB4 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 4 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4CONFIG2" width="16" page="1" offset="0x13c" internal="0" description="ADC PPB4 Sum Shift Register">
		<bitfield id="SHIFT" description="Post Processing Block 4 Right Shift" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="Post Processing Block 4 Sync. Input Select" begin="9" end="4" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="Post Processing Block 4 Software Force Sync. " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSINTSEL" description="Post Processing Block 4 Interrupt Source Select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMPSEL" description="Post Processing Block 4 Compare Source Select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4PSUM" width="32" page="1" offset="0x13e" internal="0" description="ADC PPB4 Partial Sum Register">
		<bitfield id="PSUM" description="Post Processing Block 4 Oversampling Partial Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMAX" width="32" page="1" offset="0x140" internal="0" description="ADC PPB4 Partial Max Register">
		<bitfield id="PMAX" description="Post Processing Block 4 Oversampling Partial Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMAXI" width="16" page="1" offset="0x142" internal="0" description="ADC PPB4 Partial Max Index Register">
		<bitfield id="PMAXI" description="Post Processing Block 4 Oversampling Partial Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMIN" width="32" page="1" offset="0x144" internal="0" description="ADC PPB4 Partial MIN Register">
		<bitfield id="PMIN" description="Post Processing Block 4 Oversampling Partial Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMINI" width="16" page="1" offset="0x146" internal="0" description="ADC PPB4 Partial Min Index Register">
		<bitfield id="PMINI" description="Post Processing Block 4 Oversampling Partial Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4TRIPLO2" width="32" page="1" offset="0x148" internal="0" description="ADC PPB4 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
</module>
